INSERT INTO student18.tb_book (name, author, year, pages, genre, downloads)
VALUES
	('Физика невозможного', 'Митио Каку', 2008, 460, 'Non-fiction', 2000),
	('Эгоистичный ген', 'Ричард Докинз', 1989, 610, 'Non-fiction', 400),
	('Вы, конечно, шутите мистер Фейнман', 'Ричард Фейман', 1985, 450, 'Non-fiction', 1000),
	('Кюхля', 'Юрий Тынянов', 1925, 350, 'Исторический роман', 2300),
	('За миллиард лет до конца света', 'Аркадий и Борис Стругацкие', 1977, 150, 'Фантастика', 20000),
	('Понедельник начинается в субботу', 'Аркадий и Борис Стругацкие', 1964, 250, 'Фантастика', 21000),
	('Уравнение Бога. В поисках теории всего', 'Митио Каку', 2021, 200, 'Non-fiction', 1700);

SELECT * FROM student18.tb_book_downloads_less_1000;
SELECT * FROM student18.tb_book_downloads_between_1000_and_10000;
SELECT * FROM student18.tb_book_downloads_more_10000;